from flask import Flask, jsonify
from flask_cors import CORS

app =  Flask(__name__)
CORS(app)

data = {
    "card": [
        {'id': 1, "name": 'Розробка Web-сайт та інше', 'imageUrl': 'images/internet/web-service.png', 'category': {
            "category1": 'ASP.NET / ASP.NET Core...',
            "category2": 'React, HTML, CSS...',
            "category3": 'Ecommers, WordPress...'
        }
        },
        {'id': 2, 'name': 'SMM-послуги', 'imageUrl': 'images/internet/smm-service.png', 'category': {
            "category1": 'Розробка стратегії',
            "category2": 'Управління контентом',
            "category3": 'Реклама в соціальних мережах'
        }},
         {'id': 3, "name": 'IT-консультація', 'imageUrl': 'images/internet/it-service.png', 'category': {
            "category1": 'Оптимізація ІТ-стратегії',
            "category2": 'Оптимізація бізнес-процесів',
            "category3": 'Управління ІТ-ризиками'
        }
        }
    ],
    "services": [
        {
    "id": 1,
    "title": "Розробка веб-сайтів \"Під ключ\"",
    "subtitle": "Наша команда готова реалізувати ваші ідеї та забезпечити повний цикл розробки, починаючи від концепції і закінчуючи успішним запуском.",
    "icon": "pbmit-xido-icon-blog-1",
    "href": "services-details-two.html"
  },
  {
    "id": 2,
    "title": "Інтеграція NopCommerce",
    "subtitle": "Забезпечте собі конкурентну перевагу з розгортанням та зручною конфігурацією вашого інтернет-магазину, побудованого на платформі .Net Core",
    "icon": "pbmit-xido-icon-impression-rate",
    "href": "services-details-two.html"
  },
  {
    "id": 3,
    "title": "SMM просування",
    "subtitle": "Залучайте увагу та підвищуйте свою онлайн-присутність за допомогою SMM просування. Наша команда допоможе вам будувати ефективну стратегію.",
    "icon": "pbmit-xido-icon-content-marketing",
    "href": "services-details-two.html"
  },
  {
    "id": 4,
    "title": "ІТ-консалтинг",
    "subtitle": "Допоможемо вам у виборі необхідного функціоналу веб-сайту чи додатку. Консультації по підбору техніки. Ваш бізнес отримає підтримку та рекомендації для оптимізації ІТ-процесів.",
    "icon": "pbmit-xido-icon-idea",
    "href": "services-details-two.html"
  },
  {
    "id": 5,
    "title": "Автоматизація бізнес-процесів",
    "subtitle": "Ефективна автоматизація бізнес-процесів для збільшення ефективності та економії часу у вашому бізнесі. Фокусуйтеся на стратегічних завданнях.",
    "icon": "pbmit-xido-icon-cloud-computing-1",
    "href": "services-details-two.html"
  },
  {
    "id": 6,
    "title": "Корпоративна пошта",
    "subtitle": "Підвищуйте впізнаваність бренду (info@kompania.com) за допомогою корпоративної пошти Microsoft, надаючи професійний образ вашого бізнесу.",
    "icon": "pbmit-xido-icon-global-communication",
    "href": "services-details-two.html"
  }
    ],
    "service": [
      {
        "id": 1,
        'title': 'Розробка Веб-Сайтів "Під Ключ"',
        "subtitle": 'Роззробка',
        "article": "<p>Шукаєте надійний спосіб для організації корпоративної пошти для вашої компанії? Наші послуги з корпоративної пошти стануть ідеальним рішенням для вашого бізнесу. Ми пропонуємо повний спектр послуг з налаштування та управління корпоративною електронною поштою, щоб забезпечити вам найкращі інструменти для комунікації та співпраці.</p>\r\n<p><strong>Чому обрати нас</strong>:</p>\r\n<ol>\r\n<li>\r\n<p><strong><em>Професійний підхід</em></strong>: Наша команда має багаторічний досвід у налаштуванні та управлінні корпоративною поштою. Ми знаємо, як зробити процес максимально ефективним та зручним для вашої компанії.</p>\r\n</li>\r\n<li>\r\n<p><strong><em>Індивідуальні рішення</em></strong>: Ми працюємо з кожним клієнтом індивідуально, щоб розробити рішення, яке відповідає унікальним потребам та вимогам вашого бізнесу.</p>\r\n</li>\r\n<li>\r\n<p><strong><em>Підтримка на кожному етапі</em></strong>: Ми надаємо повний цикл підтримки - від налаштування до надання консультацій та підтримки на кожному етапі роботи.</p>\r\n</li>\r\n</ol>\r\n<p><strong>Що ви отримаєте, співпрацюючи з нами</strong>:</p>\r\n<p>- Надійний і безпечний засіб комунікації для вашої компанії;</p>\r\n<p>- Персоналізовані рішення, що відповідають вашим потребам;</p>\r\n<p>- Ефективну організацію робочих процесів та співпраці в команді;</p>\r\n<p>- Підвищення продуктивності та зручності роботи з корпоративною поштою.</p>\r\n<p>Не гайте часу та можливостей - зробіть вашу корпоративну комунікацію ще ефективнішою та зручнішою з нашою підтримкою корпоративної пошти. Звертайтеся до нас, і ми з радістю допоможемо вам зробити ваш бізнес ще успішнішим!</p>",
        "imageUrl": 'https://optionflow.pro/images/services/service-13/62ea8551-8213-4f6d-9525-138bc9be39b2.jpg'
      },
       {
        "id": 2,
        'title': 'Розробка Сайтів Ключ',
        "subtitle": 'Роззробка',
        "article": 'Шукаєте ідеальний веб-сайт для вашого бізнесу? Зупиніться тут! Наша команда спеціалістів пропонує вам розробку веб-сайтів "Під ключ" - повний пакет послуг, який гарантує вам успішне втілення всіх ваших потреб і бажань. Чому варто обрати нас? Ми не лише створимо вам привабливий та сучасний веб-сайт, але й забезпечимо його повноцінне функціонування. Наші професіонали звернуть увагу на кожну деталь - від дизайну та зручності використання до оптимізації для пошукових систем. За допомогою наших послуг ви отримаєте: - Індивідуальний підхід до кожного клієнта. - Максимально ефективне використання технологій. - Гарантію якості та надійності. - Підтримку та консультації на кожному етапі роботи. В розробці веб-сайтів ми використовуємо передові технології для забезпечення якісного та сучасного результату. Ось кілька ключових технологій, які ми використовуємо: ASP.NET / ASP.NET Core: Ці технології від Microsoft є потужними інструментами для розробки веб-додатків. Вони забезпечують високу продуктивність, безпеку та масштабованість. ASP.NET Core, зокрема, пропонує переваги у роботі на різних платформах та знижує час розробки завдяки модульній структурі. React: Як одна з найпопулярніших JavaScript бібліотек для створення інтерактивних користувацьких інтерфейсів, React дозволяє створювати швидкі, масштабовані та ефективні веб-додатки. Використання React дозволяє нам створювати динамічний та залучаючий контент для вашого веб-сайту. HTML, CSS: Основні мови розмітки та стилізації веб-сторінок. Ми дотримуємося найсучасніших стандартів HTML і CSS для забезпечення кращої доступності, швидкості завантаження та зручного користувацького досвіду. NopCommerce, Wordpress: Якщо вам потрібен інтернет-магазин, ми використовуємо NopCommerce для створення потужних та функціональних електронних комерційних платформ. Для інших видів веб-сайтів, які вимагають простоти в управлінні та швидкості розгортання, ми використовуємо Wordpress, одну з найпопулярніших платформ для управління вмістом. Використовуючи ці технології, ми забезпечуємо ваш веб-сайт із сучасним дизайном, швидким завантаженням та повною функціональністю, що допоможе вам залучати клієнтів та розвивати ваш бізнес в інтернеті. Не гайте часу на пошук інших варіантів - звертайтесь до нас за професійною розробкою вашого веб-проекту і отримайте готовий сайт, що привертає клієнтів та забезпечує ваш успіх у мережі Інтернет!',
        "imageUrl": 'https://optionflow.pro/images/services/service-13/62ea8551-8213-4f6d-9525-138bc9be39b2.jpg'
      }, 
       {
        "id": 3,
        'title': 'Розробка Веб-Сайтів',
        "subtitle": 'Роззробка',
        "article": 'Шукаєте ідеальний веб-сайт для вашого бізнесу? Зупиніться тут! Наша команда спеціалістів пропонує вам розробку веб-сайтів "Під ключ" - повний пакет послуг, який гарантує вам успішне втілення всіх ваших потреб і бажань. Чому варто обрати нас? Ми не лише створимо вам привабливий та сучасний веб-сайт, але й забезпечимо його повноцінне функціонування. Наші професіонали звернуть увагу на кожну деталь - від дизайну та зручності використання до оптимізації для пошукових систем. За допомогою наших послуг ви отримаєте: - Індивідуальний підхід до кожного клієнта. - Максимально ефективне використання технологій. - Гарантію якості та надійності. - Підтримку та консультації на кожному етапі роботи. В розробці веб-сайтів ми використовуємо передові технології для забезпечення якісного та сучасного результату. Ось кілька ключових технологій, які ми використовуємо: ASP.NET / ASP.NET Core: Ці технології від Microsoft є потужними інструментами для розробки веб-додатків. Вони забезпечують високу продуктивність, безпеку та масштабованість. ASP.NET Core, зокрема, пропонує переваги у роботі на різних платформах та знижує час розробки завдяки модульній структурі. React: Як одна з найпопулярніших JavaScript бібліотек для створення інтерактивних користувацьких інтерфейсів, React дозволяє створювати швидкі, масштабовані та ефективні веб-додатки. Використання React дозволяє нам створювати динамічний та залучаючий контент для вашого веб-сайту. HTML, CSS: Основні мови розмітки та стилізації веб-сторінок. Ми дотримуємося найсучасніших стандартів HTML і CSS для забезпечення кращої доступності, швидкості завантаження та зручного користувацького досвіду. NopCommerce, Wordpress: Якщо вам потрібен інтернет-магазин, ми використовуємо NopCommerce для створення потужних та функціональних електронних комерційних платформ. Для інших видів веб-сайтів, які вимагають простоти в управлінні та швидкості розгортання, ми використовуємо Wordpress, одну з найпопулярніших платформ для управління вмістом. Використовуючи ці технології, ми забезпечуємо ваш веб-сайт із сучасним дизайном, швидким завантаженням та повною функціональністю, що допоможе вам залучати клієнтів та розвивати ваш бізнес в інтернеті. Не гайте часу на пошук інших варіантів - звертайтесь до нас за професійною розробкою вашого веб-проекту і отримайте готовий сайт, що привертає клієнтів та забезпечує ваш успіх у мережі Інтернет!',
        "imageUrl": 'https://optionflow.pro/images/services/service-13/62ea8551-8213-4f6d-9525-138bc9be39b2.jpg'
      },
       {
        "id": 4,
        'title': 'Розробка "Під Ключ"',
        "subtitle": 'Роззробка',
        "article": 'Шукаєте ідеальний веб-сайт для вашого бізнесу? Зупиніться тут! Наша команда спеціалістів пропонує вам розробку веб-сайтів "Під ключ" - повний пакет послуг, який гарантує вам успішне втілення всіх ваших потреб і бажань. Чому варто обрати нас? Ми не лише створимо вам привабливий та сучасний веб-сайт, але й забезпечимо його повноцінне функціонування. Наші професіонали звернуть увагу на кожну деталь - від дизайну та зручності використання до оптимізації для пошукових систем. За допомогою наших послуг ви отримаєте: - Індивідуальний підхід до кожного клієнта. - Максимально ефективне використання технологій. - Гарантію якості та надійності. - Підтримку та консультації на кожному етапі роботи. В розробці веб-сайтів ми використовуємо передові технології для забезпечення якісного та сучасного результату. Ось кілька ключових технологій, які ми використовуємо: ASP.NET / ASP.NET Core: Ці технології від Microsoft є потужними інструментами для розробки веб-додатків. Вони забезпечують високу продуктивність, безпеку та масштабованість. ASP.NET Core, зокрема, пропонує переваги у роботі на різних платформах та знижує час розробки завдяки модульній структурі. React: Як одна з найпопулярніших JavaScript бібліотек для створення інтерактивних користувацьких інтерфейсів, React дозволяє створювати швидкі, масштабовані та ефективні веб-додатки. Використання React дозволяє нам створювати динамічний та залучаючий контент для вашого веб-сайту. HTML, CSS: Основні мови розмітки та стилізації веб-сторінок. Ми дотримуємося найсучасніших стандартів HTML і CSS для забезпечення кращої доступності, швидкості завантаження та зручного користувацького досвіду. NopCommerce, Wordpress: Якщо вам потрібен інтернет-магазин, ми використовуємо NopCommerce для створення потужних та функціональних електронних комерційних платформ. Для інших видів веб-сайтів, які вимагають простоти в управлінні та швидкості розгортання, ми використовуємо Wordpress, одну з найпопулярніших платформ для управління вмістом. Використовуючи ці технології, ми забезпечуємо ваш веб-сайт із сучасним дизайном, швидким завантаженням та повною функціональністю, що допоможе вам залучати клієнтів та розвивати ваш бізнес в інтернеті. Не гайте часу на пошук інших варіантів - звертайтесь до нас за професійною розробкою вашого веб-проекту і отримайте готовий сайт, що привертає клієнтів та забезпечує ваш успіх у мережі Інтернет!',
        "imageUrl": 'https://optionflow.pro/images/services/service-13/62ea8551-8213-4f6d-9525-138bc9be39b2.jpg'
      } 
    ],
}


@app.route('/api/cards', methods=['GET'])
def get_cards():
    return jsonify(data["card"])

@app.route('/api/services', methods=['GET'])
def get_services():
    return jsonify(data["services"])

@app.route('/api/service', methods=['GET'])
def get_service():
    return jsonify(data["service"])

if __name__ == "__main__":
    app.run(debug=True, host="0.0.0.0", port=2000)

